
**** Speed commands
#+begin_src emacs-lisp 
  (defun dan/org-show-next-heading-tidily ()
    "Show next entry, keeping other entries closed."
    (if (save-excursion (end-of-line) (outline-invisible-p))
        (progn (org-show-entry) (show-children))
      (outline-next-heading)
      (unless (and (bolp) (org-on-heading-p))
        (org-up-heading-safe)
        (hide-subtree)
        (error "Boundary reached"))
      (org-overview)
      (org-reveal t)
      (org-show-entry)
      (show-children)))
  
  (defun dan/org-show-previous-heading-tidily ()
    "Show previous entry, keeping other entries closed."
    (let ((pos (point)))
      (outline-previous-heading)
      (unless (and (< (point) pos) (bolp) (org-on-heading-p))
        (goto-char pos)
        (hide-subtree)
        (error "Boundary reached"))
      (org-overview)
      (org-reveal t)
      (org-show-entry)
      (show-children)))
  
  (setq org-use-speed-commands t)
  (add-to-list 'org-speed-commands-user
               '("n" dan/org-show-next-heading-tidily))
  (add-to-list 'org-speed-commands-user 
               '("p" dan/org-show-previous-heading-tidily))
#+end_src

#+results:
| p | dan/org-show-previous-heading-tidily |
| n | dan/org-show-next-heading-tidily     |
